In [1]:
# this my first pyhton program
hello python
print("hello world)

SyntaxError: unterminated string literal (detected at line 4) (1405877222.py, line 4)

In [2]:
print("hello world")

hello world

In [3]:
# day2
## variable and operator
x = "python" 
y = "is"
z = "amazing"
print(x,y,z)

print()

print(x)
print(y)
print(z)

python is amazing

python
is
amazing

In [4]:
x = y = z = "orange"
print(x)
print(y)
print(z)

orange
orange
orange

In [5]:
x,y,z = "orange","banana","cherry"
print(x,y,z)

orange banana cherry

In [1]:
x = 4.5
print(x)
print(type(x))

4.5
<class 'float'>

In [3]:
y = 6
print(y)
print(type(y))

6
<class 'int'>

In [5]:
z = 6+4j
print(z)
print(type(z))

(6+4j)
<class 'complex'>

In [7]:
a = "this is ths day2 of python"
print(a)
print(type(a))

this is ths day2 of python
<class 'str'>

In [9]:
n = [1,2,3,4,5,6,7,8,9]
print(n)
print(type(n))

[1, 2, 3, 4, 5, 6, 7, 8, 9]
<class 'list'>

In [13]:
m = (1,2,3,4,5,6,7,8,9)
print(m)
print(type(m))

(1, 2, 3, 4, 5, 6, 7, 8, 9)
<class 'tuple'>

In [15]:
%whos

Variable               Type        Data/Info
--------------------------------------------
a                      str         this is ths day2 of python
dataframe_columns      function    <function dataframe_colum<...>ns at 0x0000024EDC503100>
dataframe_hash         function    <function dataframe_hash at 0x0000024EDC4CCAE0>
dtypes_str             function    <function dtypes_str at 0x0000024EDC502840>
get_dataframes         function    <function get_dataframes at 0x0000024EDDC5A7A0>
getpass                module      <module 'getpass' from 'C<...>conda3\\Lib\\getpass.py'>
hashlib                module      <module 'hashlib' from 'C<...>conda3\\Lib\\hashlib.py'>
import_pandas_safely   function    <function import_pandas_s<...>ly at 0x0000024EDC4CC860>
is_data_frame          function    <function is_data_frame at 0x0000024EDC502E80>
json                   module      <module 'json' from 'C:\\<...>\Lib\\json\\__init__.py'>
m                      tuple       n=9
n                      tuple       n=9
x                      float       4.5
y                      int         6
z                      complex     (6+4j)

# operators in python
a = 4
b = 3.4
print(a+b)

In [18]:
a = 3
b = 2.3
print(a+b)

5.3

In [20]:
n = 3+6i
m = 5
print(n+m)

SyntaxError: invalid decimal literal (774572148.py, line 1)

In [22]:
n = 3+6j
m = 5
print(n+m)

(8+6j)

# Day3

# build in function
# abs() function

In [1]:
# build in function
# abs() function
x = -7.5
print(abs(x))

7.5

In [3]:
x = abs(-7.5)
print(x)

7.5

In [5]:
y = -8
print(abs(y))

8

In [7]:
z = 3+5j
print(abs(z))

5.830951894845301

# bin function

In [39]:
x = 13
print(bin(x))

0b1101

In [13]:
y = bin(36)
print(y)

0b100100

# python bytes function

In [17]:
y = 16
print(bytes(y))

b'\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00'

In [19]:
# python chr() function
x = chr(97)
print(x)

a

In [21]:
x = 97
print(chr(x))

a

In [23]:
y = 98
print(chr(y))

b

In [25]:
z = 100
print(chr(z))

d

In [27]:
# complex function
x = complex(2,3)
print(x)

(2+3j)

In [29]:
x = 2,3
print(complex(x))

TypeError: complex() first argument must be a string or a number, not 'tuple'

In [31]:
y = complex(6,9)
print(y)

(6+9j)

In [33]:
z = complex(2)
print(z)

(2+0j)

In [35]:
z = complex("2")
print(z)

(2+0j)

In [37]:
# float function
x = float(3)
print(x)

3.0

In [39]:
# int function
x = int(4.5)
print(x)

4

In [41]:
x = 45.67
print(int(x))

45

In [43]:
y = 3+5j
print(int(y))

TypeError: int() argument must be a string, a bytes-like object or a real number, not 'complex'

In [45]:
y = int(3+5j)
print(y)

TypeError: int() argument must be a string, a bytes-like object or a real number, not 'complex'

In [47]:
x = str("234")
print(x)
prnit(type(x))

234

NameError: name 'prnit' is not defined

In [49]:
x = str("234")
print(x)
print(type(x))

234
<class 'str'>

In [51]:
y = str(234)
print(y)
prnit(type(y))

234

NameError: name 'prnit' is not defined

In [53]:
y = str(234)
print(y)
print(type(y)

SyntaxError: incomplete input (1853054022.py, line 3)

In [55]:
y = str(234)
print(y)
print(type(y))

234
<class 'str'>

In [57]:
# input function
x = input("Enter your name")
print("hello",x)

Enter your name sachin

hello sachin

# Day 4

# control flow statements
# if statement
write a program to calculate the percentage of the student in the subject maths science social english
and hindi

# control flow statements
# if condition
write a program to calculate the percentage of the student in the subject maths science social english
and hindi

In [7]:
x = input("Enter the name of the student")
a = int(input("Enter the marks obtained in english"))
b = int(input("Enter the marks obtained in maths"))
c = int(input("Enter the marks obtained in hindi"))
d = int(input("Enter the marks obtained in english"))
e = int(input("Enter the marks obtained in social"))
z = ((a+b+c+d+e)/500)*100
print("percentage obtained by student is ",z)

Enter the name of the student subh
Enter the marks obtained in english 87
Enter the marks obtained in maths 89
Enter the marks obtained in hindi 67
Enter the marks obtained in english 89
Enter the marks obtained in social 6

percentage obtained by student is  67.60000000000001

In [13]:
x = input("Enter the name of the student")
a = int(input("Enter the marks obtained in english"))
b = int(input("Enter the marks obtained in maths"))
c = int(input("Enter the marks obtained in hindi"))
d = int(input("Enter the marks obtained in english"))
e = int(input("Enter the marks obtained in social"))
z = ((a+b+c+d+e)/500)*100
print("percentage obtained by ",x ,"is",z)

Enter the name of the student subh
Enter the marks obtained in english 89
Enter the marks obtained in maths 8
Enter the marks obtained in hindi 99
Enter the marks obtained in english 99
Enter the marks obtained in social 99

percentage obtained by  subh is 78.8

In [19]:
a = int(input("Enter the percentage obtained by student"))
if a>=90:
    print("A grade")
if a>=75 and a<90:
    print("B grade")
if a>=65 and a<75:
    print("C grade")

Enter the percentage obtained by student 60

# if else statement
write a program to display hello if number entered by user is multiple of 5 else print bye

In [25]:
a = int(input("Enter the marks obtained by student"))
if a%5 == 0:
    print("hello")
else:
    print("bye")

Enter the marks obtained by student 67

bye

# if-elif-else
accept the city and print its monument 
Delhi-redfort 
Agra-tajmahal
Jaipur-jalmahal
Orissa-konak temple
Hydrabad-charminar
other- record not found

In [5]:
city = input("Enter city")
if city == "Delhi":
    print("The monument in delhi is redfort")
elif city == "Agra":
    print("The monument in agra is tajmahal")
elif city == "jaipur":
    print("The monument in jaipur is jalmahal")
elif city == "orissa":
    print("The monument in orissa is konak temple")
elif city == "hydrabad":
    print("The monument in hydrabad is charminar")
else:
    print("record not found")

Enter city Agra

The monument in agra is tajmahal

# Day 5
# concept of loop
# while loop
program to display number from 1 to 5

In [9]:
i = 1
while(i<=5):
    print(i)
    i = i+1

1
2
3
4
5

In [13]:
x = int(input("Enter a number"))
i = 1
while(i<=10):
    print(x*i)
    i = i+1
print("this is multiplication table of",x)

Enter a number 5

5
10
15
20
25
30
35
40
45
50
this is multiplication table of 5

#infinite looop
num = 10
while(num>9):
    print("hello")

In [3]:
i = 0
while(i<25):
    print("hello student")
    i = i+1
else:
    print("the end")

hello student
hello student
hello student
hello student
hello student
hello student
hello student
hello student
hello student
hello student
hello student
hello student
hello student
hello student
hello student
hello student
hello student
hello student
hello student
hello student
hello student
hello student
hello student
hello student
hello student
the end

# using else statement in the while loop

In [34]:
fruits = ["apple","mango","banana","plum"]
for x in fruits:
    print(x)

apple
mango
banana
plum

# looping through a string

In [31]:
for x in "banana":
    print(x)

b
a
n
a
n
a

# Day 7
# strings in python
## creating string in python
a = 'hello'
print(a)

In [5]:
x = "we are learning python and this is our day 7 class"
print(x)
print(type(x))

we are learning python and this is our day 7 class
<class 'str'>

In [13]:
# multiline strings
a = """During the period 2000–500 BCE, many regions 
      of the subcontinent transitioned from the Chalcolithic
      cultures to the Iron Age ones.[87] The Vedas, the oldest
      scriptures associated with Hinduism,[88] were composed during
      this period,[89] and historians have analysed these to posit a Vedic culture
      in the Punjab region and the upper Gangetic Plain.[87] Most historians also consider
      this period to have encompassed several waves of Indo-Aryan migration into the subcontinent
      from the north-west.[88] The caste system, which created a hierarchy of priests, warriors, and 
      free peasants, but which excluded indigenous peoples by labelling their occupations impure, arose during this period.[90] """
print(a)
print(len(a))

During the period 2000–500 BCE, many regions
      of the subcontinent transitioned from the Chalcolithic
      cultures to the Iron Age ones.[87] The Vedas, the oldest
      scriptures associated with Hinduism,[88] were composed during
      this period,[89] and historians have analysed these to posit a Vedic culture
      in the Punjab region and the upper Gangetic Plain.[87] Most historians also consider
      this period to have encompassed several waves of Indo-Aryan migration into the subcontinent
      from the north-west.[88] The caste system, which created a hierarchy of priests, warriors, and
      free peasants, but which excluded indigenous peoples by labelling their occupations impure, arose during this period.[90]
740

# indexing strings

In [23]:
a ="hello student"
print(a[11])
print(a[-2])
print(a[-8])

n
n

# slicing of string

In [28]:
s = "hello student how are you"
print(s[0:5])

hello

In [1]:
s = "hello student how are you"
print(s[6:8])

st

In [5]:
s = "hello students how are you"
print(s[0:20:2])

hlosuet o

In [7]:
s = "hello student how are you"
print(s[0:0:-1])

In [11]:
s = "hello student how are you"
print(s[::-1])

uoy era woh tneduts olleh

# length of string

In [17]:
s = "hello student how are you"
print(len(s))

25

# upper method

In [43]:
x = "hello student how are you"
print(x.upper())

HELLO STUDENT HOW ARE YOU

In [45]:
# lower method
z = "hello student how are you"
print(z.lower())

hello student how are you

# replace function

In [47]:
y = "hello how are you"
print(y.replace("how","why"))

hello why are you

In [50]:
p = "hello how are you"
print(p.replace("h","n"))

nello now are you

# find method

In [53]:
a = "python is great"
print(a.find("g"))

10

In [55]:
a = "python is great"
print(a.find("o"))

4

# Day 8

# list in python

In [9]:
mylist = ["apple","banana","cherry","mango"]
print(mylist)
print(type(mylist))

['apple', 'banana', 'cherry', 'mango']
<class 'list'>

# Allow duplicate

In [12]:
mylist = ["mango","banana","cherry","apple","mango"]
print(mylist)

['mango', 'banana', 'cherry', 'apple', 'mango']

# data type

In [19]:
list1 = ["apple","banana","cherry"]
list2 = [1,2,3]
list3 = [6.7,8.9,2.3]
list4 = [true,false,true]
print(list1)
print(list2)
print(list3)
print(list4)

NameError: name 'true' is not defined

In [21]:
list1 = ["apple", "banana", "cherry"]
list2 = [1,2,3]
list3 = [6.7,8.9,2.3]
list4 = [true, false, true]
print(list1)
print(list2)
print(list3)
print(list4)

NameError: name 'true' is not defined

In [23]:
list1 = ["apple", "banana", "cherry"]
list2 = [1,2,3]
list3 = [6.7,8.9,2.3]
list4 = [True, False, True]
print(list1)
print(list2)
print(list3)
print(list4)

NameError: name 'true' is not defined

In [25]:
list1 = ["apple", "banana", "cherry"]
list2 = [1,2,3]
list3 = [6.7,8.9,2.3]
list4 = [True, False, True]
print(list1)
print(list2)
print(list3)
print(list4)

['apple', 'banana', 'cherry']
[1, 2, 3]
[6.7, 8.9, 2.3]
[True, False, True]

In [29]:
a = ["apple", "banana", "cherry",1,2,3,6.7,8.9,2.3,True, False, True]
print(a)
print(type(a))
print(len(a))

['apple', 'banana', 'cherry', 1, 2, 3, 6.7, 8.9, 2.3, True, False, True]
<class 'list'>
12

# Access Item

In [32]:
thislist = [12,34,56,87,36,89,2,9,90,8]
print(thislist[3])

87

# slicing of list

In [35]:
 thislist = [12,34,56,87,36,89,2,9,90,8]
print([0:7])

SyntaxError: invalid syntax (3095137665.py, line 2)

In [39]:
thislist = [12,34,56,87,36,89,2,9,90,8]
print(thislist[0:7])

[12, 34, 56, 87, 36, 89, 2]

In [41]:
thislist = [12,34,56,87,36,89,2,9,90,8]
print(thislist[2:7])

[56, 87, 36, 89, 2]

# change item

In [43]:
z = ["apple","banana","papaya"]
z[1] = "mango"
print(z)

['apple', 'mango', 'papaya']

In [45]:
x = [1,3,5,-6,8,9,-10,3.5,1.23]
x[3] = "mango"
print(x)

[1, 3, 5, 'mango', 8, 9, -10, 3.5, 1.23]

In [48]:
z = [-12,56,89,4.5,68.9]
z[4] = "string"
print(z)

[-12, 56, 89, 4.5, 'string']

# change a range of item

In [51]:
x = [1,3,5,-6,8,9,-10,3.5,1.23]
x[1:6] = ["sachin","rahul","mohit","virat"]
print(x)

[1, 'sachin', 'rahul', 'mohit', 'virat', -10, 3.5, 1.23]

In [53]:
z = [56,89,4.5,68.9]
z.append(-12)
print(z)

[56, 89, 4.5, 68.9, -12]

In [55]:
a = ["red","blue","green","yellow","white"]
a.remove("white")
print(a)

['red', 'blue', 'green', 'yellow']

In [57]:
z = [56,89,4.5,68.9,"blue","green"]
z.reverse()
print(z)

['green', 'blue', 68.9, 4.5, 89, 56]

In [65]:
z = [56,89,-4,68,-89]
print(len(z))
x = 0
for i in range(5):
    x = x + z[i]
    i = i+1
print(x)

5
120

# multiply all the number of a list

In [68]:
a = [1,2,3,4,5,6,7,8,9]
x = 1
for i in range(9):
    x = x*a[i]
    i = i+1
print(x)

362880

# Day 9

# tuples in python

In [74]:
mytuple = (1,2,3,4,5,6,7)
print(mytuple)
print(len(mytuple))
print(type(mytuple))

(1, 2, 3, 4, 5, 6, 7)
7
<class 'tuple'>

# mixed datatype

In [76]:
mytuple = (1,2,37.6,3.1,-7,-9,5+2j,3+2j,"apple","mango")
print(mytuple)
print(type(mytuple))

(1, 2, 37.6, 3.1, -7, -9, (5+2j), (3+2j), 'apple', 'mango')
<class 'tuple'>

# empty tuple

In [81]:
mytuple = ()
print(mytuple)
print(type(mytuple))

()
<class 'tuple'>

# nested tuple

In [86]:
a = ("hello","how",[1,23,4],(2.3,4,5.7))
print(a)
print(type(a))

('hello', 'how', [1, 23, 4], (2.3, 4, 5.7))
<class 'tuple'>

# creating a tuple with only one item

In [89]:
x = ("worldwide")
print(x)
print(type(x))

worldwide
<class 'str'>

In [91]:
x = ("worldwide",)
print(x)
print(type(x))

('worldwide',)
<class 'tuple'>

In [93]:
a = tuple(("a","e","i","o","u"))
print(a)
print(type(a))

('a', 'e', 'i', 'o', 'u')
<class 'tuple'>

# slicing

In [96]:
a = (12,34,56,87,36,89,2,9,90,8)
print(a[0:6])

(12, 34, 56, 87, 36, 89)

In [98]:
a = (12,34,56,87,36,89,2,9,90,8)
print(a[:7])

(12, 34, 56, 87, 36, 89, 2)

In [100]:
a = (12,34,56,87,36,89,2,9,90,8)
print(a[::2])

(12, 56, 36, 2, 90)

# reverse

In [103]:
s = (12,34,56,87,36,89,2,9,90,8)
print(s[::-1])

(8, 90, 9, 2, 89, 36, 87, 56, 34, 12)

In [105]:
s = (12,34,56,87,36,89,2,9,90,8)

print(s[::])
print(s[3:])
print(s[:4])
print(s[-2:])

(12, 34, 56, 87, 36, 89, 2, 9, 90, 8)

In [3]:
s = (12,34,56,87,36,89,2,9,90,8)
print(s[-2::-1])

(90, 9, 2, 89, 36, 87, 56, 34, 12)

# insert in tuple

In [5]:
x = (1,3,5,-6,8,9,-10,3.5,1.23)
y = list(x)
y.append(-12)
x= tuple(y)
print(x)
print(type(x))

(1, 3, 5, -6, 8, 9, -10, 3.5, 1.23, -12)
<class 'tuple'>

In [13]:
x = (1,3,5,-6,8,9,-10,3.5,1.23)
y = list(x)
y.append("hellow")
x = tuple(y)
print(x)
print(type(x))

(1, 3, 5, -6, 8, 9, -10, 3.5, 1.23, 'hellow')
<class 'tuple'>

# delete from tuple

In [7]:
p = (6.7,8.9,2.3,45,-13)
a = list(p)
a.remove(-13)
p = tuple(a)
print(p)
print(type(p))

(6.7, 8.9, 2.3, 45)
<class 'tuple'>

p = (6.7,8.9,2.3,45,-13)
del p
print(p)

# loop

In [17]:
thistuple = ("red","mango","rotten")
for x in thistuple:
    print(x)

red
mango
rotten

# join two tuple

In [21]:
tuple1 = ("a","b","c")
tuple2 = (1,2,3,4)
tuple3 = (3.4,5.8,8.7,1.4)
tuple4 = tuple1 + tuple2 + tuple3
print(tuple4)

('a', 'b', 'c', 1, 2, 3, 4, 3.4, 5.8, 8.7, 1.4)

# multiply

In [32]:
a = ("hello","how","are","you")
b = a*4
print(b)
print(len(a))
print(len(b))

('hello', 'how', 'are', 'you', 'hello', 'how', 'are', 'you', 'hello', 'how', 'are', 'you', 'hello', 'how', 'are', 'you')
4
16

In [36]:
T = (1,2,3,4,5,6,7,8,9)
print(T+T)
print(T*2)
print(T+T+T)
print(len(T))

(1, 2, 3, 4, 5, 6, 7, 8, 9, 1, 2, 3, 4, 5, 6, 7, 8, 9)
(1, 2, 3, 4, 5, 6, 7, 8, 9, 1, 2, 3, 4, 5, 6, 7, 8, 9)
(1, 2, 3, 4, 5, 6, 7, 8, 9, 1, 2, 3, 4, 5, 6, 7, 8, 9, 1, 2, 3, 4, 5, 6, 7, 8, 9)
9

# write a program to take 5 input from user and store them in tuple

In [40]:
tuple = ()
i = 0 
for i in range(5):
    x = input("enter you want")
    tuple = tuple + (x,)
    i = i+1
print(tuple)

enter you want sachin
enter you want 12
enter you want 12.56
enter you want 7+6j
enter you want mango

('sachin', '12', '12.56', '7+6j', 'mango')

In [46]:
tuple = ()
i = 0 
for i in range(5):
    x = int(input("enter you want"))
    tuple = tuple + (x,)
    i = i+1
print(tuple)

enter you want 12
enter you want 34
enter you want 56
enter you want 87
enter you want 09

(12, 34, 56, 87, 9)

# Day 10

# create a dictionary

In [7]:
d = {
    "red" : "litchi",
    "green" : "grape",
    "year" : 1997
}
print(d)
print(type(d))

{'red': 'litchi', 'green': 'grape', 'year': 1997}
<class 'dict'>

In [11]:
a = {
    "ID" : 3436,
    "color" : "red",
    "year" : 1998
}
print(a["color"])
print(a["ID"])

red
3436

In [13]:
a = {
    "mango" : "fruit",
    "color" : "red",
    "day" : "sun",
    "year" : 1889,
    "year" : 1997
}
print(a)

{'mango': 'fruit', 'color': 'red', 'day': 'sun', 'year': 1997}

# dictionary length

In [15]:
a = {
    "mango" : "fruit",
    "color" : "red",
    "day" : "sun",
    "year" : 1889,
}
print(len(a))

4

In [18]:
dict = {
    "mango" : "fruit",
    "year" : 1889,
    'a' : [1,2,3,4,5],
    'b' : (2.3, 45.2,67.8,90),
    'c' : False
}
print(dict)

{'mango': 'fruit', 'year': 1889, 'a': [1, 2, 3, 4, 5], 'b': (2.3, 45.2, 67.8, 90), 'c': False}

In [20]:
x = dict(name = "swati", age = 23, country = "india")
print(x)

TypeError: 'dict' object is not callable

In [24]:
dict = {
    "mango" : "fruit",
    "year" : 1889,
    'a' : [1,2,3,4,5],
    'b' : (2.3, 45.2,67.8,90),
    'c' : False
}
print(dict['a'])
print(dict['mango'])

[1, 2, 3, 4, 5]
fruit

In [26]:
a = {
    "name" : "sachin",
    "age" : "45",
    "country" : "india"
}
print(a['name'])

sachin

In [30]:
a = {
    "name" : "sachin", "age" : "45", "country" : "india"
}
print(a.get('age'))
print(a.get('country'))

45
india

In [34]:
a = {
    "name" : "sachin", "age" : "45", "country" : "india"
}
x = a.keys()
print(x)

dict_keys(['name', 'age', 'country'])

In [1]:
a = { "name" : "sachin", "age" : "34", "country" : "india"}
a['age'] = 28
print(a)

{'name': 'sachin', 'age': 28, 'country': 'india'}

In [3]:
a = { "name" : "sachin", "age" : "34", "country" : "india"}
a.update({"mail id" : "sachin@gmail.com"})
print(a)

{'name': 'sachin', 'age': '34', 'country': 'india', 'mail id': 'sachin@gmail.com'}

In [5]:
a = { "name" : "sachin", "age" : "34", "country" : "india"}
a.pop('age')
print(a)

{'name': 'sachin', 'country': 'india'}

In [7]:
x = {"red": "apple", "blue": "color", "roll": "analyst", "id" :34663}
del x["blue"]
print(x)

{'red': 'apple', 'roll': 'analyst', 'id': 34663}

In [9]:
x = {"red": "apple", "blue": "color", "roll": "analyst", "id" :34663}
del x
print(x)

NameError: name 'x' is not defined

In [11]:
dict1 = {"red": 10, "blue": 20}
dict2 = {"apple": "kashmir", "mango": "ratan"}
dict3 = {"id": 343, "roll": 123}
dict4 = {}
for d in (dict1, dict2, dict3): dict4.update(d)
    print(dict4)

IndentationError: unexpected indent (429641286.py, line 6)

In [13]:
dict1 = {"red": 10, "blue": 20}
dict2 = {"apple": "kashmir", "mango": "ratan"}
dict3 = {"id": 343, "roll": 123}
dict4 = {}
for d in (dict1, dict2, dict3): 
    dict4.update(d)
    print(dict4)

{'red': 10, 'blue': 20}
{'red': 10, 'blue': 20, 'apple': 'kashmir', 'mango': 'ratan'}
{'red': 10, 'blue': 20, 'apple': 'kashmir', 'mango': 'ratan', 'id': 343, 'roll': 123}

In [17]:
d = dict()
for x in range(1,16):
    dict[x] = x**2
    print(d)

TypeError: 'type' object does not support item assignment

In [23]:
d = dict()
for x in range(1,16):
    d[x] = x**2
    print(d)

{1: 1}
{1: 1, 2: 4}
{1: 1, 2: 4, 3: 9}
{1: 1, 2: 4, 3: 9, 4: 16}
{1: 1, 2: 4, 3: 9, 4: 16, 5: 25}
{1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36}
{1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49}
{1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64}
{1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64, 9: 81}
{1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64, 9: 81, 10: 100}
{1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64, 9: 81, 10: 100, 11: 121}
{1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64, 9: 81, 10: 100, 11: 121, 12: 144}
{1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64, 9: 81, 10: 100, 11: 121, 12: 144, 13: 169}
{1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64, 9: 81, 10: 100, 11: 121, 12: 144, 13: 169, 14: 196}
{1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64, 9: 81, 10: 100, 11: 121, 12: 144, 13: 169, 14: 196, 15: 225}

## check whether a given key already exists in dictionary

In [10]:
d = {1:10, 2:20, 3:30, 4:40, 5:50}
def is_key_present(x):
    if x in d:
        print("key is present")
    else:
        print("key is not present")
is_key_present(7)

key is not present

In [12]:
is_key_present(5)

key is present

# Day 11
# Set
## creating a set

In [18]:
a = {"animal","ball","cars","mango"}
print(a)
print(type(a))

{'ball', 'animal', 'cars', 'mango'}
<class 'set'>

## set item are unordered

In [6]:
x = {"apple", 45.7, "amazon", 39, 6+2j}
print(x[3])

TypeError: 'set' object is not subscriptable

In [8]:
x = {"apple", "hello", "amazon", "how"}
print(x[3])

TypeError: 'set' object is not subscriptable

In [12]:
a = {"hello", "how", "are"}
print(a[1])

TypeError: 'set' object is not subscriptable

In [14]:
z = {"deck", "short", "mini"}
print(z[0])

TypeError: 'set' object is not subscriptable

## duplicates not alllowed

In [17]:
a = {"hello", "how", "are", "apple", "hello", "amazon", "how"}
print(a)

{'how', 'hello', 'amazon', 'apple', 'are'}

## true and 1 is considered the same value

In [22]:
a = {"hello","how","are", 1,2,3,True}
print(a)

{1, 2, 3, 'how', 'hello', 'are'}

In [24]:
k = {"hello", "how", "are", "apple", "hello", "amazon", "how",1,2,3,True}
print(len(k)) f
L/'[oplupfff.f

8

In [28]:
x1 = {1, 2, 3, 4, 3}
x2 = {23.4, 1.2, 5.8, 23.4}
x3 = {"a", "b", "c", "b"}
x4 = {True, False, True}
print(x1,x2,x3,x4)

{1, 2, 3, 4} {1.2, 5.8, 23.4} {'b', 'c', 'a'} {False, True}

In [32]:
a = {"apple",5.89 , "amazon", 1, 2, True, False, -65, 3+2j}
print(a)
print(len(a))

{False, 1, 2, 5.89, 'amazon', (3+2j), 'apple', -65}
8

In [34]:
z = {[1, 2, 3, 4, 3]}
print(z)

TypeError: unhashable type: 'list'

In [36]:
z = {(1, 2, 3, 4, 3)}
print(z)

{(1, 2, 3, 4, 3)}

In [38]:
z = {{"a":1, "b":2, "c":3, "d":4}}
print(z)

TypeError: unhashable type: 'dict'

In [40]:
a = {{1,2,3},{14.2,37.4,78.9}};print(a)

TypeError: unhashable type: 'set'

In [42]:
a = {{1,2,3},{14.2,37.4,78.9}}
print(a)

TypeError: unhashable type: 'set'

## The Set() constructor

In [45]:
thiset = set(("hello", "how", "are", "apple", "amazon"))
print(thiset)
print(type(thiset))

{'how', 'hello', 'amazon', 'apple', 'are'}
<class 'set'>

## Creating empty set

In [50]:
a = {}
print(a)
print(type(a))

{}
<class 'dict'>

In [52]:
empty = set()
print(empty)
print(type(empty))

set()
<class 'set'>

In [54]:
z = {"a", "b", "c", "d", "e"}
for i in z:
    print(i)

a
e
b
c
d

## check if 'item' is present in the set

In [61]:
s = {"python", "code", "Anaconda"}
print("Anaconda" in s)

True

In [65]:
x = {"apple", "hello", "amazon", "how"}
print("how" in x)
print("mango" in x)

True
False

# Add item

In [68]:
z = {"a", "b", "c", "d"}
z.add(19)
print(z)

{'b', 'c', 'd', 19, 'a'}

In [70]:
a = {"hello", "how", "are"}
b = {14.2,37.4,78.9}
a.update(b)
print(a)

{'how', 'hello', 37.4, 14.2, 78.9, 'are'}

# Remove Set items

In [74]:
a = {"apple", 40, "hello", 80, "amazon", "how", 60, "a", "b", 30}
a.remove("apple")
print(a)

{'how', 'hello', 'amazon', 40, 'b', 80, 30, 60, 'a'}

In [76]:
a = {"apple", 40, "hello", 80, "amazon", "how", 60, "a", "b", 30}
a.remove(30)
print(a)

{'how', 'hello', 'amazon', 40, 'b', 'apple', 80, 60, 'a'}

In [80]:
m = {"apple", 40, "hello", 80, "amazon", "how", 60, "a", "b", 30}
m.pop()
print(m)

{'hello', 'amazon', 40, 'b', 'apple', 80, 30, 60, 'a'}

In [82]:
m = {"apple", 40, "hello", 80, "amazon", "how", 60, "a", "b", 30}
m.clear()
print(m)

set()

In [84]:
m = {"apple", 40, "hello", 80, "amazon", "how", 60, "a", "b", 30}
del m
print(m)

NameError: name 'm' is not defined

# join two set

In [87]:
z = {"a", "b", "c", "d"}
x = {1, 2, 3, 4, 3}
y = z.union(x)
print(y)

{1, 2, 3, 4, 'b', 'c', 'd', 'a'}

## Write a python program to find max and min value

In [90]:
setn = {14.2,37.4,78.9,56,23}
print("original set is", setn)

original set is {23, 37.4, 14.2, 56, 78.9}

In [92]:
setn = {14.2,37.4,78.9,56,23}
print("maximum value from set is", max(setn))

maximum value from set is 78.9

In [96]:
setn = {14.2,37.4,78.9,56,23}
print("minimum value from set is", min(setn))

minimum value from set is 14.2

In [98]:
set1 = {20,50,70,10,30}
set2 = {40,90,10,70,20}
print(set1.intersection(set2))

{10, 20, 70}

# Day 14
# Pandas library

In [2]:
import pandas as pd

In [6]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [8]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [10]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [12]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [14]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [16]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [1]:
df

NameError: name 'df' is not defined

In [3]:
import pandas as pd

In [5]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [7]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [11]:
df[['Name','Sex','Ticket','Cabin','Embarked']]

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

In [15]:
df.dtypes == 'object'

PassengerId    False
Survived       False
Pclass         False
Name            True
Sex             True
Age            False
SibSp          False
Parch          False
Ticket          True
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [17]:
df.dtypes == 'float64'

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare            True
Cabin          False
Embarked       False
dtype: bool

In [21]:
df
df[df.dtypes[df.dtypes == 'object'].index]

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

In [23]:
df[df.dtypes[df.dtypes == 'float64'].index]

      Age     Fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [25]:
df[df.dtypes[df.dtypes == 'int64'].index]

     PassengerId  Survived  Pclass  SibSp  Parch
0              1         0       3      1      0
1              2         1       1      1      0
2              3         1       3      0      0
3              4         1       1      1      0
4              5         0       3      0      0
..           ...       ...     ...    ...    ...
886          887         0       2      0      0
887          888         1       1      0      0
888          889         0       3      1      2
889          890         1       1      0      0
890          891         0       3      0      0

[891 rows x 5 columns]

In [29]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [31]:
df.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [33]:
df.tail(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [35]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [37]:
df[['Ticket']]

               Ticket
0           A/5 21171
1            PC 17599
2    STON/O2. 3101282
3              113803
4              373450
..                ...
886            211536
887            112053
888        W./C. 6607
889            111369
890            370376

[891 rows x 1 columns]

In [39]:
df[['Ticket']][5:20]

       Ticket
5      330877
6       17463
7      349909
8      347742
9      237736
10    PP 9549
11     113783
12  A/5. 2151
13     347082
14     350406
15     248706
16     382652
17     244373
18     345763
19       2649

In [41]:
df[['Ticket']][5:21:2]

    Ticket
5   330877
7   349909
9   237736
11  113783
13  347082
15  248706
17  244373
19    2649

In [43]:
df[['Ticket','Cabin']]

               Ticket Cabin
0           A/5 21171   NaN
1            PC 17599   C85
2    STON/O2. 3101282   NaN
3              113803  C123
4              373450   NaN
..                ...   ...
886            211536   NaN
887            112053   B42
888        W./C. 6607   NaN
889            111369  C148
890            370376   NaN

[891 rows x 2 columns]

In [45]:
df[['Ticket','Cabin']][10:20]

       Ticket Cabin
10    PP 9549    G6
11     113783  C103
12  A/5. 2151   NaN
13     347082   NaN
14     350406   NaN
15     248706   NaN
16     382652   NaN
17     244373   NaN
18     345763   NaN
19       2649   NaN

In [49]:
df[['Ticket','Cabin','Name']][5:20:2]

    Ticket Cabin                                 Name
5   330877   NaN                     Moran, Mr. James
7   349909   NaN       Palsson, Master. Gosta Leonard
9   237736   NaN  Nasser, Mrs. Nicholas (Adele Achem)
11  113783  C103             Bonnell, Miss. Elizabeth
13  347082   NaN          Andersson, Mr. Anders Johan
15  248706   NaN     Hewlett, Mrs. (Mary D Kingcome)
17  244373   NaN         Williams, Mr. Charles Eugene
19    2649   NaN              Masselmani, Mrs. Fatima

In [51]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [57]:
df['new_col'] = 'a'

In [64]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,a
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,a
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,a
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,a
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,a
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,a
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,a
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,a
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,a
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,a

In [66]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,a
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,a
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,a
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,a
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,a
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,a
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,a
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,a
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,a
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,a

In [68]:
df['new_col'] = 1

In [70]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,1
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1

In [72]:
df['cotlin'] = 1.2

In [74]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col,cotlin
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,1.2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,1.2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,1.2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,1.2
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,1.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1,1.2
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1,1.2
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,1,1.2
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1,1.2
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1,1.2

In [80]:
df.insert(loc = 2, column = 'food', value = 1.2)

ValueError: cannot insert food, already exists

In [78]:
df

,PassengerId,Survived,Pclass,food,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col,cotlin
0,1,0,3,1.2,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,1.2
1,2,1,1,1.2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,1.2
2,3,1,3,1.2,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,1.2
3,4,1,1,1.2,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,1.2
4,5,0,3,1.2,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,1.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,1.2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1,1.2
887,888,1,1,1.2,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1,1.2
888,889,0,3,1.2,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,1,1.2
889,890,1,1,1.2,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1,1.2
890,891,0,3,1.2,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1,1.2

In [82]:
df.insert(loc = 2, column = 'food', value = 1.2)

ValueError: cannot insert food, already exists

In [84]:
df

,PassengerId,Survived,Pclass,food,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col,cotlin
0,1,0,3,1.2,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,1.2
1,2,1,1,1.2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,1.2
2,3,1,3,1.2,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,1.2
3,4,1,1,1.2,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,1.2
4,5,0,3,1.2,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,1.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,1.2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1,1.2
887,888,1,1,1.2,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1,1.2
888,889,0,3,1.2,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,1,1.2
889,890,1,1,1.2,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1,1.2
890,891,0,3,1.2,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1,1.2

In [86]:
df.insert(loc = 5, column = 'equipment',value = 'cylinder')

In [88]:
df

,PassengerId,Survived,Pclass,food,Name,equipment,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col,cotlin
0,1,0,3,1.2,"Braund, Mr. Owen Harris",cylinder,male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,1.2
1,2,1,1,1.2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",cylinder,female,38.0,1,0,PC 17599,71.2833,C85,C,1,1.2
2,3,1,3,1.2,"Heikkinen, Miss. Laina",cylinder,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,1.2
3,4,1,1,1.2,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",cylinder,female,35.0,1,0,113803,53.1000,C123,S,1,1.2
4,5,0,3,1.2,"Allen, Mr. William Henry",cylinder,male,35.0,0,0,373450,8.0500,NaN,S,1,1.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,1.2,"Montvila, Rev. Juozas",cylinder,male,27.0,0,0,211536,13.0000,NaN,S,1,1.2
887,888,1,1,1.2,"Graham, Miss. Margaret Edith",cylinder,female,19.0,0,0,112053,30.0000,B42,S,1,1.2
888,889,0,3,1.2,"Johnston, Miss. Catherine Helen ""Carrie""",cylinder,female,NaN,1,2,W./C. 6607,23.4500,NaN,S,1,1.2
889,890,1,1,1.2,"Behr, Mr. Karl Howell",cylinder,male,26.0,0,0,111369,30.0000,C148,C,1,1.2
890,891,0,3,1.2,"Dooley, Mr. Patrick",cylinder,male,32.0,0,0,370376,7.7500,NaN,Q,1,1.2

In [90]:
df.describe()

,PassengerId,Survived,Pclass,food,Age,SibSp,Parch,Fare,new_col,cotlin
count,891.000000,891.000000,891.000000,8.910000e+02,714.000000,891.000000,891.000000,891.000000,891.0,8.910000e+02
mean,446.000000,0.383838,2.308642,1.200000e+00,29.699118,0.523008,0.381594,32.204208,1.0,1.200000e+00
std,257.353842,0.486592,0.836071,1.977307e-14,14.526497,1.102743,0.806057,49.693429,0.0,1.977307e-14
min,1.000000,0.000000,1.000000,1.200000e+00,0.420000,0.000000,0.000000,0.000000,1.0,1.200000e+00
25%,223.500000,0.000000,2.000000,1.200000e+00,20.125000,0.000000,0.000000,7.910400,1.0,1.200000e+00
50%,446.000000,0.000000,3.000000,1.200000e+00,28.000000,0.000000,0.000000,14.454200,1.0,1.200000e+00
75%,668.500000,1.000000,3.000000,1.200000e+00,38.000000,1.000000,0.000000,31.000000,1.0,1.200000e+00
max,891.000000,1.000000,3.000000,1.200000e+00,80.000000,8.000000,6.000000,512.329200,1.0,1.200000e+00

# Day 15
# Pandas Part 2

In [93]:
import pandas as pd

In [95]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [97]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [99]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [101]:
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [111]:
a = df['Name'][0:10]
a

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
5                                     Moran, Mr. James
6                              McCarthy, Mr. Timothy J
7                       Palsson, Master. Gosta Leonard
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                  Nasser, Mrs. Nicholas (Adele Achem)
Name: Name, dtype: object

In [113]:
type(a)

pandas.core.series.Series

In [115]:
l = ['fort','a1','b1','c1','d1','e1','f1','g1','h1','i1']
pd.Series(a, index = l)

fort    NaN
a1      NaN
b1      NaN
c1      NaN
d1      NaN
e1      NaN
f1      NaN
g1      NaN
h1      NaN
i1      NaN
Name: Name, dtype: object

In [117]:
pd.Series(list(a), index = l)

fort                              Braund, Mr. Owen Harris
a1      Cumings, Mrs. John Bradley (Florence Briggs Th...
b1                                 Heikkinen, Miss. Laina
c1           Futrelle, Mrs. Jacques Heath (Lily May Peel)
d1                               Allen, Mr. William Henry
e1                                       Moran, Mr. James
f1                                McCarthy, Mr. Timothy J
g1                         Palsson, Master. Gosta Leonard
h1      Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
i1                    Nasser, Mrs. Nicholas (Adele Achem)
dtype: object

In [121]:
m =pd.Series([100,200,300,400,500,600,700,800,900], index = [1,2,3,4,5,6,7,8,9])

In [123]:
m

1    100
2    200
3    300
4    400
5    500
6    600
7    700
8    800
9    900
dtype: int64

In [125]:
m2 = pd.Series(['a','b','c','d','e','f','g','h','i','j'], index = [0,1,2,3,4,5,6,7,8,9])
m2

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
8    i
9    j
dtype: object

In [134]:
m3 = pd.concat([m,m2])

In [136]:
m3

1    100
2    200
3    300
4    400
5    500
6    600
7    700
8    800
9    900
0      a
1      b
2      c
3      d
4      e
5      f
6      g
7      h
8      i
9      j
dtype: object

In [138]:
m3[1]

1    100
1      b
dtype: object

In [140]:
n1 = pd.Series([100,200,300,400,500], index = [1,2,3,4,5])

In [142]:
n1

1    100
2    200
3    300
4    400
5    500
dtype: int64

In [144]:
n2 = pd.Series([600,700,800,900,1000], index = [1,2,3,4,5])

In [146]:
n2

1     600
2     700
3     800
4     900
5    1000
dtype: int64

In [148]:
n1*n2

1     60000
2    140000
3    240000
4    360000
5    500000
dtype: int64

In [150]:
n1+n2

1     700
2     900
3    1100
4    1300
5    1500
dtype: int64

In [152]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [156]:
df.drop('PassengerId', axis = 1)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [158]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [160]:
df.drop('Cabin', axis = 1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,Q

In [162]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [164]:
df.drop('Survived', axis = 1, inplace = True)

In [166]:
df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [168]:
df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [170]:
df.drop(3)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [172]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [174]:
df.drop(3, inplace = True)

In [176]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [178]:
df.set_index('PassengerId')

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
...,...,...,...,...,...,...,...,...,...,...
887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [180]:
df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [182]:
df.set_index('Name', inplace = True)

In [184]:
df

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,
"Braund, Mr. Owen Harris",1,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Allen, Mr. William Henry",5,3,male,35.0,0,0,373450,8.0500,NaN,S
"Moran, Mr. James",6,3,male,NaN,0,0,330877,8.4583,NaN,Q
...,...,...,...,...,...,...,...,...,...,...
"Montvila, Rev. Juozas",887,2,male,27.0,0,0,211536,13.0000,NaN,S
"Graham, Miss. Margaret Edith",888,1,female,19.0,0,0,112053,30.0000,B42,S
"Johnston, Miss. Catherine Helen ""Carrie""",889,3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S
"Behr, Mr. Karl Howell",890,1,male,26.0,0,0,111369,30.0000,C148,C
"Dooley, Mr. Patrick",891,3,male,32.0,0,0,370376,7.7500,NaN,Q

In [186]:
df

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,
"Braund, Mr. Owen Harris",1,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Allen, Mr. William Henry",5,3,male,35.0,0,0,373450,8.0500,NaN,S
"Moran, Mr. James",6,3,male,NaN,0,0,330877,8.4583,NaN,Q
...,...,...,...,...,...,...,...,...,...,...
"Montvila, Rev. Juozas",887,2,male,27.0,0,0,211536,13.0000,NaN,S
"Graham, Miss. Margaret Edith",888,1,female,19.0,0,0,112053,30.0000,B42,S
"Johnston, Miss. Catherine Helen ""Carrie""",889,3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S
"Behr, Mr. Karl Howell",890,1,male,26.0,0,0,111369,30.0000,C148,C
"Dooley, Mr. Patrick",891,3,male,32.0,0,0,370376,7.7500,NaN,Q

# df.reset_index()

making a dataframe from the dictionary

In [189]:
d = { 'key1' : [1,2,3,4],
     'key2' : [5,6,7,8],
     'key3' : [3,6,8,0]
    }
print(d)

{'key1': [1, 2, 3, 4], 'key2': [5, 6, 7, 8], 'key3': [3, 6, 8, 0]}

In [193]:
pd.DataFrame(d)

   key1  key2  key3
0     1     5     3
1     2     6     6
2     3     7     8
3     4     8     0

In [195]:
df1 = pd.read_csv("taxonomy.csv")

FileNotFoundError: [Errno 2] No such file or directory: 'taxonomy.csv'